<a href="https://colab.research.google.com/github/KazumaShachou/DataScience/blob/master/Pandas_DataManipulation_2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Hierarchical Indexing

In [83]:
import pandas as pd
import numpy as np

In [84]:
index = [('California', 2000), ('California', 2010),
('New York', 2000), ('New York', 2010),
('Texas', 2000), ('Texas', 2010)]
populations = [33871648, 37253956,
18976457, 19378102,
20851820, 25145561]

pop = pd.Series(populations, index =index)
pop

(California, 2000)    33871648
(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
(Texas, 2010)         25145561
dtype: int64

In [85]:
pop[('California', 2010) : ('Texas'  , 2000)]

(California, 2010)    37253956
(New York, 2000)      18976457
(New York, 2010)      19378102
(Texas, 2000)         20851820
dtype: int64

In [86]:
pop[[i for i in pop.index if i[1] == 2010]]   #not recomended

(California, 2010)    37253956
(New York, 2010)      19378102
(Texas, 2010)         25145561
dtype: int64

In [87]:
#better way
index = pd.MultiIndex.from_tuples(index)
index

MultiIndex([('California', 2000),
            ('California', 2010),
            (  'New York', 2000),
            (  'New York', 2010),
            (     'Texas', 2000),
            (     'Texas', 2010)],
           )

In [88]:
pop = pop.reindex(index)
pop

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [89]:
pop[:, 2010]

California    37253956
New York      19378102
Texas         25145561
dtype: int64

In [90]:
#The unstack() method will quickly convert a multiplyindexed Series into a conventionally indexed DataFrame
pop_df = pop.unstack()
pop_df

                2000      2010
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [91]:
#stack is the opposite
pop_df.stack()

California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [92]:
#add column
pop_df = pd.DataFrame({'total': pop, 'under18':[9267089, 9284094,4687374, 4318033,5906301, 6879014]})
pop_df

                    total  under18
California 2000  33871648  9267089
           2010  37253956  9284094
New York   2000  18976457  4687374
           2010  19378102  4318033
Texas      2000  20851820  5906301
           2010  25145561  6879014

In [93]:
 #just for 18, proportion
f_u18 = pop_df['under18'] / pop_df['total']
f_u18.unstack()

                2000      2010
California  0.273594  0.249211
New York    0.247010  0.222831
Texas       0.283251  0.273568

In [94]:
#Methods of MultiIndex Creation
df = pd.DataFrame(np.random.rand(4, 2),
                  index=[['a','a','b','b'], [1, 2, 1, 2]],
                  columns = ['data1', 'data2'])
df

        data1     data2
a 1  0.853990  0.821490
  2  0.456929  0.471255
b 1  0.466033  0.013680
  2  0.512298  0.605062

In [95]:
    data = {('California', 2000):33871648,
            ('California', 2010): 37253956,
            ('Texas', 2000): 20851820,
            ('Texas', 2010): 25145561,
            ('New York', 2000): 18976457,
            ('New York', 2010): 19378102}
pd.Series(data)

California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
New York    2000    18976457
            2010    19378102
dtype: int64

In [96]:
#Explicit MultiIndex constructors
pd.MultiIndex.from_arrays([['a', 'a', 'b','b'], [1, 2, 1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [97]:
pd.MultiIndex.from_tuples([('a',1), ('a',2), ('b',1), ('b',2)])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [98]:
pd.MultiIndex.from_product([['a', 'b'], [1, 2]])

MultiIndex([('a', 1),
            ('a', 2),
            ('b', 1),
            ('b', 2)],
           )

In [99]:
pop.index.names = ['state', 'year']
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [100]:
# hierarchical indices and columns
index = pd.MultiIndex.from_product([[2013, 2014], [1, 2]],
                                   names=['year', 'visit'])
columns = pd.MultiIndex.from_product([['Bob', 'Kana', 'Meiko'], ['HR', 'Temp']],
                                     names = ['subject', 'type'])

In [101]:
# mock some data
data = np.around(np.random.randn(4, 6),1)
data[:, ::2] *= 10
data +=37

In [102]:
#create the DataFrame

health_data =pd.DataFrame(data, index = index, columns=columns)
health_data

subject      Bob        Kana       Meiko
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      43.0  36.5  30.0  37.5  16.0  36.5
     2      33.0  37.1  22.0  35.9  37.0  36.8
2014 1      46.0  35.6  44.0  36.7  37.0  38.0
     2      47.0  37.5  22.0  39.0  37.0  36.5

In [103]:
health_data['Kana']

type          HR  Temp
year visit
2013 1      30.0  37.5
     2      22.0  35.9
2014 1      44.0  36.7
     2      22.0  39.0

In [104]:
pop

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [105]:
pop['Texas', 2000]

20851820

In [106]:
pop['Texas']

year
2000    20851820
2010    25145561
dtype: int64

In [107]:
pop['California' : 'New York']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
dtype: int64

In [108]:
pop.loc['California': 'Texas']

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [109]:
pop[:,2000]

state
California    33871648
New York      18976457
Texas         20851820
dtype: int64

In [110]:
pop[pop > 22000000]

state       year
California  2000    33871648
            2010    37253956
Texas       2010    25145561
dtype: int64

In [111]:
pop[['California', 'Texas']]   #just return California and textas, not new york

state       year
California  2000    33871648
            2010    37253956
Texas       2000    20851820
            2010    25145561
dtype: int64

In [112]:
health_data

subject      Bob        Kana       Meiko
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      43.0  36.5  30.0  37.5  16.0  36.5
     2      33.0  37.1  22.0  35.9  37.0  36.8
2014 1      46.0  35.6  44.0  36.7  37.0  38.0
     2      47.0  37.5  22.0  39.0  37.0  36.5

In [113]:
health_data['Meiko', 'HR']

year  visit
2013  1        16.0
      2        37.0
2014  1        37.0
      2        37.0
Name: (Meiko, HR), dtype: float64

In [114]:
health_data.iloc[:2, :2]

subject      Bob
type          HR  Temp
year visit
2013 1      43.0  36.5
     2      33.0  37.1

In [115]:
health_data.iloc[2:, 2:]

subject     Kana       Meiko
type          HR  Temp    HR  Temp
year visit
2014 1      44.0  36.7  37.0  38.0
     2      22.0  39.0  37.0  36.5

In [116]:
health_data.loc[:,('Kana', 'HR')]

year  visit
2013  1        30.0
      2        22.0
2014  1        44.0
      2        22.0
Name: (Kana, HR), dtype: float64

In [117]:
index = pd.MultiIndex.from_product([['a', 'b','c'], [1, 2,]])
data = pd.Series(np.random.rand(6), index = index)
data.index.names = ['char', 'int']
data

char  int
a     1      0.464805
      2      0.967589
b     1      0.459271
      2      0.486884
c     1      0.955608
      2      0.636296
dtype: float64

In [118]:
data['a': 'b']

char  int
a     1      0.464805
      2      0.967589
b     1      0.459271
      2      0.486884
dtype: float64

In [119]:
pop.unstack(0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [120]:
pop.unstack(level= 0)

state  California  New York     Texas
year
2000     33871648  18976457  20851820
2010     37253956  19378102  25145561

In [121]:
pop.unstack(level = 1)

year            2000      2010
state
California  33871648  37253956
New York    18976457  19378102
Texas       20851820  25145561

In [122]:
#recover the original series
pop.unstack().stack()

state       year
California  2000    33871648
            2010    37253956
New York    2000    18976457
            2010    19378102
Texas       2000    20851820
            2010    25145561
dtype: int64

In [123]:
#Index setting and resetting
pop_flat = pop.reset_index(name = 'population')
pop_flat

        state  year  population
0  California  2000    33871648
1  California  2010    37253956
2    New York  2000    18976457
3    New York  2010    19378102
4       Texas  2000    20851820
5       Texas  2010    25145561

In [124]:
#returns a multiply indexed Data Frame
pop_flat.set_index(['state', 'year'])

                 population
state      year
California 2000    33871648
           2010    37253956
New York   2000    18976457
           2010    19378102
Texas      2000    20851820
           2010    25145561

In [125]:
health_data

subject      Bob        Kana       Meiko
type          HR  Temp    HR  Temp    HR  Temp
year visit
2013 1      43.0  36.5  30.0  37.5  16.0  36.5
     2      33.0  37.1  22.0  35.9  37.0  36.8
2014 1      46.0  35.6  44.0  36.7  37.0  38.0
     2      47.0  37.5  22.0  39.0  37.0  36.5

In [126]:
#Data Aggregations on Multi-Indices
data_mean = health_data.mean(level = 'year')
data_mean

subject   Bob         Kana        Meiko
type       HR   Temp    HR   Temp    HR   Temp
year
2013     38.0  36.80  26.0  36.70  26.5  36.65
2014     46.5  36.55  33.0  37.85  37.0  37.25

In [127]:
#mean of columns
data_mean.mean(axis = 1, level = 'type')

type         HR       Temp
year
2013  30.166667  36.716667
2014  38.833333  37.216667

## Combining Datasets: Concat and Append

In [128]:
import pandas as pd
import numpy as np

In [129]:
def make_df(cols, ind):
  data = {c:[str(c) + str(i) for i in ind]
          for c in cols}
  return pd.DataFrame(data, ind)

make_df('ABC', range(3))

    A   B   C
0  A0  B0  C0
1  A1  B1  C1
2  A2  B2  C2

In [130]:
#concatenation in np 
x = [1, 3, 4]
y = [5, 9, 3]
z = [2, 8, 6]

np.concatenate([x,y,z])

array([1, 3, 4, 5, 9, 3, 2, 8, 6])

In [131]:
x = [[2, 3],
     [6, 9]]
np.concatenate([x, x], axis = 1)

array([[2, 3, 2, 3],
       [6, 9, 6, 9]])

In [132]:
#Concatenation with pd.concat
be1 = pd.Series(['A','B', 'C'], index = [1, 2, 3])
be2 = pd.Series(['D', 'E', 'F'], index = [4, 5, 6,])

pd.concat([be1, be2])

1    A
2    B
3    C
4    D
5    E
6    F
dtype: object

In [133]:
df1 = make_df('AB', [1, 2])
df2 = make_df('AB', [3, 4])

print(df1); print(df2); print(pd.concat([df1, df2]))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
1  A1  B1
2  A2  B2
3  A3  B3
4  A4  B4

In [134]:
df3 = make_df('AB', [0, 1])
df4 = make_df('CD', [0, 1])

print(df3); print(df4); print(pd.concat([df3, df4], axis = 1))

    A   B
0  A0  B0
1  A1  B1
    C   D
0  C0  D0
1  C1  D1
    A   B   C   D
0  A0  B0  C0  D0
1  A1  B1  C1  D1

In [135]:
#Ignoring the index
print(df1); print(df2); print(pd.concat([df1, df2], ignore_index=True))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
    A   B
0  A1  B1
1  A2  B2
2  A3  B3
3  A4  B4

In [136]:
#Adding MultiIndex keys.
print(df1); print(df2); print(pd.concat([df1, df2], keys= ['x', 'y']))

    A   B
1  A1  B1
2  A2  B2
    A   B
3  A3  B3
4  A4  B4
      A   B
x 1  A1  B1
  2  A2  B2
y 3  A3  B3
  4  A4  B4

In [137]:
  df5 = make_df('ABC', [1, 2])
  df6 = make_df('DEF', [3, 4])

  df7 = pd.concat([df5, df6])
  df7

     A    B    C    D    E    F
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3  NaN  NaN  NaN   D3   E3   F3
4  NaN  NaN  NaN   D4   E4   F4

In [138]:
df7.fillna(0)

    A   B   C   D   E   F
1  A1  B1  C1   0   0   0
2  A2  B2  C2   0   0   0
3   0   0   0  D3  E3  F3
4   0   0   0  D4  E4  F4

In [139]:
print(pd.concat([df5, df6], join='inner'))

Empty DataFrame
Columns: []
Index: [1, 2, 3, 4]

In [140]:
#append() method  , can be used if you want in the place of pd.concat()
df5.append(df6)

     A    B    C    D    E    F
1   A1   B1   C1  NaN  NaN  NaN
2   A2   B2   C2  NaN  NaN  NaN
3  NaN  NaN  NaN   D3   E3   F3
4  NaN  NaN  NaN   D4   E4   F4

## Combining Datasets: Merge and Join

In [141]:
#One-to-one joins
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],'hire_date': [2004, 2008, 2012, 2014]})

print(df1); print(df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [142]:
#combine the information
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [143]:
#Many-to-one joins
df4 = pd.DataFrame({'group': ['accounting', 'engineering', 'HR'],
                    'supervisor ': ['Okayuu', 'Pekora', 'Watame']})
print(df3); print(df4); print(pd.merge(df3, df4))

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014
         group supervisor
0   accounting      Okayuu
1  engineering      Pekora
2           HR      Watame
  employee group  hire_date supervisor
0      Sue    HR       2014      Watame

In [144]:
pd.merge(df3, df4)

  employee group  hire_date supervisor
0      Sue    HR       2014      Watame

In [145]:
#Many-to-many joins
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting','Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux','spreadsheets', 'organization']})
pd.merge(df1, df5)

  employee        group        skills
0      Bob   Accounting          math
1      Bob   Accounting  spreadsheets
2     Jake  Engineering        coding
3     Jake  Engineering         linux
4     Lisa  Engineering        coding
5     Lisa  Engineering         linux
6      Sue           HR  spreadsheets
7      Sue           HR  organization

In [146]:
pd.merge(df1, df2, on= 'employee')

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [147]:
#left and right
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],'salary': [70000, 80000, 120000, 90000]})

pd.merge(df1, df3, left_on = "employee", right_on = "name")

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [148]:
pd.merge(df1, df3, left_on="employee", right_on="name").drop('name', axis = 1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [149]:
df1a = df1.set_index('employee')
df2a = df2.set_index('employee')
print(df1a); print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2012
Sue            2014

In [150]:
df1a.join(df2a)   #no repetition

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2012
Lisa      Engineering       2004
Sue                HR       2014

In [151]:
df6 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],'food': ['fish', 'beans', 'bread']},columns=['name', 'food'])
df7 = pd.DataFrame({'name': ['Mary', 'Joseph'],'drink': ['wine', 'beer']},columns=['name', 'drink'])
print(df6); print(df7); print(pd.merge(df6, df7))

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
     name drink
0    Mary  wine
1  Joseph  beer
   name   food drink
0  Mary  bread  wine

In [152]:
#single “name” entry in common
pd.merge(df6, df7, how = 'inner')

   name   food drink
0  Mary  bread  wine

In [153]:
pd.merge(df6, df7, how = 'left')

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [154]:
df8 = pd.DataFrame({'name': ['Watame', 'Hachama', 'Rushia', 'Mio'],
                    'rank' : [1, 2, 3, 4]})
df8

      name  rank
0   Watame     1
1  Hachama     2
2   Rushia     3
3      Mio     4

In [155]:
df9 = pd.DataFrame({'name': ['Watame', 'Hachama', 'Rushia', 'Mio'],
                    'rank' : [4, 1, 3, 2]})
df9

      name  rank
0   Watame     4
1  Hachama     1
2   Rushia     3
3      Mio     2

In [156]:
pd.merge(df8, df9, on = 'name')

      name  rank_x  rank_y
0   Watame       1       4
1  Hachama       2       1
2   Rushia       3       3
3      Mio       4       2

In [160]:
pd.merge(df8, df9, on = 'name', suffixes=["_L", "_R"])

      name  rank_L  rank_R
0   Watame       1       4
1  Hachama       2       1
2   Rushia       3       3
3      Mio       4       2